Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D28CD1G.atdf
        <register caption="Overlay 2 DMA Address Register" name="LCDC_OVR2ADDR" offset="0x00000260" rw="RW" size="4">
          <bitfield caption="DMA Transfer Overlay 2 Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Overlay 2 DMA Control Register" name="LCDC_OVR2CTRL" offset="0x00000264" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="DFETCH"/>
          <bitfield caption="Lookup Table Fetch Enable" mask="0x00000002" name="LFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="ADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONEIEN"/>
        </register>
        <register caption="Overlay 2 DMA Next Register" name="LCDC_OVR2NEXT" offset="0x00000268" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="NEXT"/>
        </register>
        <register caption="Overlay 2 Configuration Register 0" name="LCDC_OVR2CFG0" offset="0x0000026C" rw="RW" size="4">
          <bitfield caption="AHB Burst Length" mask="0x00000030" name="BLEN" values="LCDC_OVR2CFG0__BLEN"/>
          <bitfield caption="Defined Length Burst Only For Channel Bus Transaction" mask="0x00000100" name="DLBO"/>
          <bitfield caption="Hardware Rotation Optimization Disable" mask="0x00001000" name="ROTDIS"/>
          <bitfield caption="Hardware Rotation Lock Disable" mask="0x00002000" name="LOCKDIS"/>
        </register>
        <register caption="Overlay 2 Configuration Register 1" name="LCDC_OVR2CFG1" offset="0x00000270" rw="RW" size="4">
          <bitfield caption="Color Lookup Table Mode Enable" mask="0x00000001" name="CLUTEN"/>
          <bitfield caption="RGB Mode Input Selection" mask="0x000000F0" name="RGBMODE" values="LCDC_OVR2CFG1__RGBMODE"/>
          <bitfield caption="Color Lookup Table Mode Input Selection" mask="0x00000300" name="CLUTMODE" values="LCDC_OVR2CFG1__CLUTMODE"/>
        </register>
        <register caption="Overlay 2 Configuration Register 2" name="LCDC_OVR2CFG2" offset="0x00000274" rw="RW" size="4">
          <bitfield caption="Horizontal Window Position" mask="0x000007FF" name="XPOS"/>
          <bitfield caption="Vertical Window Position" mask="0x07FF0000" name="YPOS"/>
        </register>
        <register caption="Overlay 2 Configuration Register 3" name="LCDC_OVR2CFG3" offset="0x00000278" rw="RW" size="4">
          <bitfield caption="Horizontal Window Size" mask="0x000007FF" name="XSIZE"/>
          <bitfield caption="Vertical Window Size" mask="0x07FF0000" name="YSIZE"/>
        </register>
        <register caption="Overlay 2 Configuration Register 4" name="LCDC_OVR2CFG4" offset="0x0000027C" rw="RW" size="4">
          <bitfield caption="Horizontal Stride" mask="0xFFFFFFFF" name="XSTRIDE"/>
        </register>
        <register caption="Overlay 2 Configuration Register 5" name="LCDC_OVR2CFG5" offset="0x00000280" rw="RW" size="4">
          <bitfield caption="Pixel Stride" mask="0xFFFFFFFF" name="PSTRIDE"/>
        </register>
        <register caption="Overlay 2 Configuration Register 6" name="LCDC_OVR2CFG6" offset="0x00000284" rw="RW" size="4">
          <bitfield caption="Blue Default" mask="0x000000FF" name="BDEF"/>
          <bitfield caption="Green Default" mask="0x0000FF00" name="GDEF"/>
          <bitfield caption="Red Default" mask="0x00FF0000" name="RDEF"/>
        </register>
        <register caption="Overlay 2 Configuration Register 7" name="LCDC_OVR2CFG7" offset="0x00000288" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key" mask="0x000000FF" name="BKEY"/>
          <bitfield caption="Green Color Component Chroma Key" mask="0x0000FF00" name="GKEY"/>
          <bitfield caption="Red Color Component Chroma Key" mask="0x00FF0000" name="RKEY"/>
        </register>
        <register caption="Overlay 2 Configuration Register 8" name="LCDC_OVR2CFG8" offset="0x0000028C" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key Mask" mask="0x000000FF" name="BMASK"/>
          <bitfield caption="Green Color Component Chroma Key Mask" mask="0x0000FF00" name="GMASK"/>
          <bitfield caption="Red Color Component Chroma Key Mask" mask="0x00FF0000" name="RMASK"/>
        </register>
        <register caption="Overlay 2 Configuration Register 9" name="LCDC_OVR2CFG9" offset="0x00000290" rw="RW" size="4">
          <bitfield caption="Blender Chroma Key Enable" mask="0x00000001" name="CRKEY"/>
          <bitfield caption="Blender Inverted Blender Output Enable" mask="0x00000002" name="INV"/>
          <bitfield caption="Blender Iterated Color Enable" mask="0x00000004" name="ITER2BL"/>
          <bitfield caption="Blender Use Iterated Color" mask="0x00000008" name="ITER"/>
          <bitfield caption="Blender Reverse Alpha" mask="0x00000010" name="REVALPHA"/>
          <bitfield caption="Blender Global Alpha Enable" mask="0x00000020" name="GAEN"/>
          <bitfield caption="Blender Local Alpha Enable" mask="0x00000040" name="LAEN"/>
          <bitfield caption="Blender Overlay Layer Enable" mask="0x00000080" name="OVR"/>
          <bitfield caption="Blender DMA Layer Enable" mask="0x00000100" name="DMA"/>
          <bitfield caption="Use Replication logic to expand RGB color to 24 bits" mask="0x00000200" name="REP"/>
          <bitfield caption="Destination Chroma Keying" mask="0x00000400" name="DSTKEY"/>
          <bitfield caption="Blender Global Alpha" mask="0x00FF0000" name="GA"/>
        </register>
        <register caption="High-End Overlay Channel Enable Register" name="LCDC_HEOCHER" offset="0x00000340" rw="W" size="4">
          <bitfield caption="Channel Enable" mask="0x00000001" name="CHEN"/>
          <bitfield caption="Update Overlay Attributes Enable" mask="0x00000002" name="UPDATEEN"/>
          <bitfield caption="Add To Queue Enable" mask="0x00000004" name="A2QEN"/>
        </register>
        <register caption="High-End Overlay Channel Disable Register" name="LCDC_HEOCHDR" offset="0x00000344" rw="W" size="4">
          <bitfield caption="Channel Disable" mask="0x00000001" name="CHDIS"/>
          <bitfield caption="Channel Reset" mask="0x00000100" name="CHRST"/>
        </register>
        <register caption="High-End Overlay Channel Status Register" name="LCDC_HEOCHSR" offset="0x00000348" rw="R" size="4">
          <bitfield caption="Channel Status" mask="0x00000001" name="CHSR"/>
          <bitfield caption="Update Overlay Attributes In Progress Status" mask="0x00000002" name="UPDATESR"/>
          <bitfield caption="Add To Queue Status" mask="0x00000004" name="A2QSR"/>
        </register>
        <register caption="High-End Overlay Interrupt Enable Register" name="LCDC_HEOIER" offset="0x0000034C" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Enable" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000040" name="OVR"/>
          <bitfield caption="End of DMA Transfer for U or UV Chrominance Interrupt Enable" mask="0x00000400" name="UDMA"/>
          <bitfield caption="Descriptor Loaded for U or UV Chrominance Interrupt Enable" mask="0x00000800" name="UDSCR"/>
          <bitfield caption="Head Descriptor Loaded for U or UV Chrominance Interrupt Enable" mask="0x00001000" name="UADD"/>
          <bitfield caption="End of List for U or UV Chrominance Interrupt Enable" mask="0x00002000" name="UDONE"/>
          <bitfield caption="Overflow for U or UV Chrominance Interrupt Enable" mask="0x00004000" name="UOVR"/>
          <bitfield caption="End of DMA for V Chrominance Transfer Interrupt Enable" mask="0x00040000" name="VDMA"/>
          <bitfield caption="Descriptor Loaded for V Chrominance Interrupt Enable" mask="0x00080000" name="VDSCR"/>
          <bitfield caption="Head Descriptor Loaded for V Chrominance Interrupt Enable" mask="0x00100000" name="VADD"/>
          <bitfield caption="End of List for V Chrominance Interrupt Enable" mask="0x00200000" name="VDONE"/>
          <bitfield caption="Overflow for V Chrominance Interrupt Enable" mask="0x00400000" name="VOVR"/>
        </register>
        <register caption="High-End Overlay Interrupt Disable Register" name="LCDC_HEOIDR" offset="0x00000350" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Disable" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Disable" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Disable" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Disable" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000040" name="OVR"/>
          <bitfield caption="End of DMA Transfer for U or UV Chrominance Component Interrupt Disable" mask="0x00000400" name="UDMA"/>
          <bitfield caption="Descriptor Loaded for U or UV Chrominance Component Interrupt Disable" mask="0x00000800" name="UDSCR"/>
          <bitfield caption="Head Descriptor Loaded for U or UV Chrominance Component Interrupt Disable" mask="0x00001000" name="UADD"/>
          <bitfield caption="End of List Interrupt for U or UV Chrominance Component Disable" mask="0x00002000" name="UDONE"/>
          <bitfield caption="Overflow Interrupt for U or UV Chrominance Component Disable" mask="0x00004000" name="UOVR"/>
          <bitfield caption="End of DMA Transfer for V Chrominance Component Interrupt Disable" mask="0x00040000" name="VDMA"/>
          <bitfield caption="Descriptor Loaded for V Chrominance Component Interrupt Disable" mask="0x00080000" name="VDSCR"/>
          <bitfield caption="Head Descriptor Loaded for V Chrominance Component Interrupt Disable" mask="0x00100000" name="VADD"/>
          <bitfield caption="End of List for V Chrominance Component Interrupt Disable" mask="0x00200000" name="VDONE"/>
          <bitfield caption="Overflow for V Chrominance Component Interrupt Disable" mask="0x00400000" name="VOVR"/>
        </register>
        <register caption="High-End Overlay Interrupt Mask Register" name="LCDC_HEOIMR" offset="0x00000354" rw="R" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Mask" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Mask" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Mask" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Mask" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Mask" mask="0x00000040" name="OVR"/>
          <bitfield caption="End of DMA Transfer for U or UV Chrominance Component Interrupt Mask" mask="0x00000400" name="UDMA"/>
          <bitfield caption="Descriptor Loaded for U or UV Chrominance Component Interrupt Mask" mask="0x00000800" name="UDSCR"/>
          <bitfield caption="Head Descriptor Loaded for U or UV Chrominance Component Mask" mask="0x00001000" name="UADD"/>
          <bitfield caption="End of List for U or UV Chrominance Component Mask" mask="0x00002000" name="UDONE"/>
          <bitfield caption="Overflow for U Chrominance Interrupt Mask" mask="0x00004000" name="UOVR"/>
          <bitfield caption="End of DMA Transfer for V Chrominance Component Interrupt Mask" mask="0x00040000" name="VDMA"/>
          <bitfield caption="Descriptor Loaded for V Chrominance Component Interrupt Mask" mask="0x00080000" name="VDSCR"/>
          <bitfield caption="Head Descriptor Loaded for V Chrominance Component Mask" mask="0x00100000" name="VADD"/>
          <bitfield caption="End of List for V Chrominance Component Mask" mask="0x00200000" name="VDONE"/>
          <bitfield caption="Overflow for V Chrominance Interrupt Mask" mask="0x00400000" name="VOVR"/>
        </register>
        <register caption="High-End Overlay Interrupt Status Register" name="LCDC_HEOISR" offset="0x00000358" rw="R" size="4">
          <bitfield caption="End of DMA Transfer" mask="0x00000004" name="DMA"/>
          <bitfield caption="DMA Descriptor Loaded" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Detected" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Detected" mask="0x00000040" name="OVR"/>
          <bitfield caption="End of DMA Transfer for U Component" mask="0x00000400" name="UDMA"/>
          <bitfield caption="DMA Descriptor Loaded for U Component" mask="0x00000800" name="UDSCR"/>
          <bitfield caption="Head Descriptor Loaded for U Component" mask="0x00001000" name="UADD"/>
          <bitfield caption="End of List Detected for U Component" mask="0x00002000" name="UDONE"/>
          <bitfield caption="Overflow Detected for U Component" mask="0x00004000" name="UOVR"/>
          <bitfield caption="End of DMA Transfer for V Component" mask="0x00040000" name="VDMA"/>
          <bitfield caption="DMA Descriptor Loaded for V Component" mask="0x00080000" name="VDSCR"/>
          <bitfield caption="Head Descriptor Loaded for V Component" mask="0x00100000" name="VADD"/>
          <bitfield caption="End of List Detected for V Component" mask="0x00200000" name="VDONE"/>
          <bitfield caption="Overflow Detected for V Component" mask="0x00400000" name="VOVR"/>
        </register>
        <register caption="High-End Overlay DMA Head Register" name="LCDC_HEOHEAD" offset="0x0000035C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFC" name="HEAD"/>
        </register>
        <register caption="High-End Overlay DMA Address Register" name="LCDC_HEOADDR" offset="0x00000360" rw="RW" size="4">
          <bitfield caption="DMA Transfer Start Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="High-End Overlay DMA Control Register" name="LCDC_HEOCTRL" offset="0x00000364" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="DFETCH"/>
          <bitfield caption="Lookup Table Fetch Enable" mask="0x00000002" name="LFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="ADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONEIEN"/>
        </register>
        <register caption="High-End Overlay DMA Next Register" name="LCDC_HEONEXT" offset="0x00000368" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="NEXT"/>
        </register>
        <register caption="High-End Overlay U-UV DMA Head Register" name="LCDC_HEOUHEAD" offset="0x0000036C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFF" name="UHEAD"/>
        </register>
        <register caption="High-End Overlay U-UV DMA Address Register" name="LCDC_HEOUADDR" offset="0x00000370" rw="RW" size="4">
          <bitfield caption="DMA Transfer Start Address for U or UV Chrominance" mask="0xFFFFFFFF" name="UADDR"/>
        </register>
        <register caption="High-End Overlay U-UV DMA Control Register" name="LCDC_HEOUCTRL" offset="0x00000374" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="UDFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="UDMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="UDSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="UADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="UDONEIEN"/>
        </register>
