Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D28CD1G.atdf
        <register-group count="8" name="SMC_PMECC" name-in-module="SMC_PMECC" offset="0xB0" size="64"/>
        <register-group count="8" name="SMC_REM" name-in-module="SMC_REM" offset="0x2B0" size="64"/>
        <register caption="PMECC Error Location Configuration Register" name="HSMC_ELCFG" offset="0x500" rw="RW" size="4">
          <bitfield caption="Sector Size" mask="0x00000001" name="SECTORSZ" values="HSMC_ELCFG__SECTORSZ"/>
          <bitfield caption="Number of Errors" mask="0x001F0000" name="ERRNUM"/>
        </register>
        <register caption="PMECC Error Location Primitive Register" name="HSMC_ELPRIM" offset="0x504" rw="R" size="4">
          <bitfield caption="Primitive Polynomial" mask="0x0000FFFF" name="PRIMITIV"/>
        </register>
        <register caption="PMECC Error Location Enable Register" name="HSMC_ELEN" offset="0x508" rw="W" size="4">
          <bitfield caption="Error Location Enable" mask="0x00003FFF" name="ENINIT"/>
        </register>
        <register caption="PMECC Error Location Disable Register" name="HSMC_ELDIS" offset="0x50C" rw="W" size="4">
          <bitfield caption="Disable Error Location Engine" mask="0x00000001" name="DIS"/>
        </register>
        <register caption="PMECC Error Location Status Register" name="HSMC_ELSR" offset="0x510" rw="R" size="4">
          <bitfield caption="Error Location Engine Busy" mask="0x00000001" name="BUSY"/>
        </register>
        <register caption="PMECC Error Location Interrupt Enable register" name="HSMC_ELIER" offset="0x514" rw="W" size="4">
          <bitfield caption="Computation Terminated Interrupt Enable" mask="0x00000001" name="DONE"/>
        </register>
        <register caption="PMECC Error Location Interrupt Disable Register" name="HSMC_ELIDR" offset="0x518" rw="W" size="4">
          <bitfield caption="Computation Terminated Interrupt Disable" mask="0x00000001" name="DONE"/>
        </register>
        <register caption="PMECC Error Location Interrupt Mask Register" name="HSMC_ELIMR" offset="0x51C" rw="R" size="4">
          <bitfield caption="Computation Terminated Interrupt Mask" mask="0x00000001" name="DONE"/>
        </register>
        <register caption="PMECC Error Location Interrupt Status Register" name="HSMC_ELISR" offset="0x520" rw="R" size="4">
          <bitfield caption="Computation Terminated Interrupt Status" mask="0x00000001" name="DONE"/>
          <bitfield caption="Error Counter value" mask="0x00003F00" name="ERR_CNT"/>
        </register>
        <register caption="PMECC Error Location SIGMA 0 Register" name="HSMC_SIGMA0" offset="0x528" rw="R" size="4">
          <bitfield caption="Coefficient of degree 0 in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA0"/>
        </register>
        <register caption="PMECC Error Location SIGMA 1 Register" name="HSMC_SIGMA1" offset="0x52C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA1"/>
        </register>
        <register caption="PMECC Error Location SIGMA 2 Register" name="HSMC_SIGMA2" offset="0x530" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA2"/>
        </register>
        <register caption="PMECC Error Location SIGMA 3 Register" name="HSMC_SIGMA3" offset="0x534" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA3"/>
        </register>
        <register caption="PMECC Error Location SIGMA 4 Register" name="HSMC_SIGMA4" offset="0x538" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA4"/>
        </register>
        <register caption="PMECC Error Location SIGMA 5 Register" name="HSMC_SIGMA5" offset="0x53C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA5"/>
        </register>
        <register caption="PMECC Error Location SIGMA 6 Register" name="HSMC_SIGMA6" offset="0x540" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA6"/>
        </register>
        <register caption="PMECC Error Location SIGMA 7 Register" name="HSMC_SIGMA7" offset="0x544" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA7"/>
        </register>
        <register caption="PMECC Error Location SIGMA 8 Register" name="HSMC_SIGMA8" offset="0x548" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA8"/>
        </register>
        <register caption="PMECC Error Location SIGMA 9 Register" name="HSMC_SIGMA9" offset="0x54C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA9"/>
        </register>
        <register caption="PMECC Error Location SIGMA 10 Register" name="HSMC_SIGMA10" offset="0x550" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA10"/>
        </register>
        <register caption="PMECC Error Location SIGMA 11 Register" name="HSMC_SIGMA11" offset="0x554" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA11"/>
        </register>
        <register caption="PMECC Error Location SIGMA 12 Register" name="HSMC_SIGMA12" offset="0x558" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA12"/>
        </register>
        <register caption="PMECC Error Location SIGMA 13 Register" name="HSMC_SIGMA13" offset="0x55C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA13"/>
        </register>
        <register caption="PMECC Error Location SIGMA 14 Register" name="HSMC_SIGMA14" offset="0x560" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA14"/>
        </register>
        <register caption="PMECC Error Location SIGMA 15 Register" name="HSMC_SIGMA15" offset="0x564" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA15"/>
        </register>
        <register caption="PMECC Error Location SIGMA 16 Register" name="HSMC_SIGMA16" offset="0x568" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA16"/>
        </register>
